app/controllers/room_controller.rb

SELECT "messages".* FROM "messages" WHERE (board_id = 1)
---
  def show
    @messages = Message.all

INSERT INTO "messages" ("post", "board_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post", "hi"], ["board_id", 1], ["user_id", 1], ["created_at", 2017-03-27 20:23:15 UTC], ["updated_at", 2017-03-27 20:23:15 UTC]]
---
  def create
    @message = Message.new(message_params)
    if @message.save